
begin   // 这是程序开始的关键字

/* 下面是程序的函数体： // test */        // xxx

    uint  ui, _ui2;                  // 关键字 uint 表示无符号整数        /* sth */
    ui = 2;                          // 赋值语句
    ui2 = 123456;

    udouble _d, d2, d3, d4;               // 关键字 double 表示无符号浮点数
    _d = 1.234567890;
    d2 = 123456789.00;
    d3 = .123456789000;
    d4 = .0;
    udouble d5, d6, d7, d8, d9;               // 关键字 double 表示无符号浮点数
    d5 = 12E+3;
    d6 = 1.23e-456;
    d7 = .1e89;
//    d8 = .0000e+2w;
    d9 = 0009876300;
    _d = ui + ui2;                   // 表达式

    d2 = d3 / ui;
    d9 = d2 + d3 * d4 - (d5 + d6) / d7 + ui //= ui2

end     // 这是程序结束的关键字
